Revit 2027 API
ComponentRepeaterSlot.IsDefault Property
 A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDefault { get; }
Public ReadOnly Property IsDefault As Boolean
	Get
public:
property bool IsDefault {
	bool get ();
}
member IsDefault : bool with get
Property Value
Boolean
See Also
Reference
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace